README.md
```mermaid
graph LR
  linkStyle default fill:#ffffff

  subgraph diagram [ML Platform - System Context]
    style diagram fill:#ffffff,stroke:#ffffff

    1["<div style='font-weight: bold'>Customer</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Customer using the banking<br />app</div>"]
    style 1 fill:#cccccc,stroke:#8e8e8e,color:#ffffff
    2["<div style='font-weight: bold'>Data Scientist</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Data scientist developing a<br />machine learning model</div>"]
    style 2 fill:#cccccc,stroke:#8e8e8e,color:#ffffff
    20("<div style='font-weight: bold'>Log aggregator</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Logging system based on ELK<br />stack</div>")
    style 20 fill:#cccccc,stroke:#8e8e8e,color:#ffffff
    24("<div style='font-weight: bold'>Metrics collector</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Reliability toolkit<br />supporting web application<br />monitoring</div>")
    style 24 fill:#cccccc,stroke:#8e8e8e,color:#ffffff
    27("<div style='font-weight: bold'>Backend application A</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Any application that makes<br />use of a REST machine<br />learning model</div>")
    style 27 fill:#cccccc,stroke:#8e8e8e,color:#ffffff
    3("<div style='font-weight: bold'>ML Platform</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Machine learning model<br />serving platform exposing<br />models over REST and Kafka.</div>")
    style 3 fill:#1168bd,stroke:#0b4884,color:#ffffff
    31("<div style='font-weight: bold'>Backend application B</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Any application that makes<br />use of a streaming machine<br />learning model</div>")
    style 31 fill:#cccccc,stroke:#8e8e8e,color:#ffffff
    35["<div style='font-weight: bold'>FE application</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Client frontend web<br />application</div>"]
    style 35 fill:#cccccc,stroke:#8e8e8e,color:#ffffff

    2-. "<div>Develops</div><div style='font-size: 70%'></div>" .->3
    3-. "<div>Sends logs to</div><div style='font-size: 70%'>[Kafka]</div>" .->20
    3-. "<div>Exposes metrics to</div><div style='font-size: 70%'>[HTTP]</div>" .->24
    27-. "<div>Requests prediction from</div><div style='font-size: 70%'>[HTTP]</div>" .->3
    31-. "<div>Sends prediction to</div><div style='font-size: 70%'>[Kafka]</div>" .->3
    35-. "<div>Requests information from</div><div style='font-size: 70%'>[HTTP]</div>" .->27
    35-. "<div>Requests information from</div><div style='font-size: 70%'>[HTTP]</div>" .->31
    1-. "<div>Uses</div><div style='font-size: 70%'></div>" .->35
  end
```
